

"""
Клієнт має унікальний телефонний номер. Він купляє товари, вказуючи назву та дату.

Формати даних:

    телефонний номер: 222-4444.

    дата: 30.11.2018

    назва товару: не більше 10 симлволів латинської абетки.

"""


#    Сформувати структуру датасету для дного користувача.


dataset = {
"112-4556":
     {
         "name": "Bob",
         "days":
             {
                 "10.12.2018":
                     {
                         "apples", "milk"
                     }
             }

      },
"221-6554":
    {
        "name": "Boba",
        "days":
            {
                "12.12.2012":
                    {
                        "apples", "meat"
                    },
                "13.12.2012":
                    {
                        "carrot", "bread"
                    }
            }
    }

}







